libsoundtouch/templates/avt_transport_uri.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <s:Body>
        <u:SetAVTransportURI xmlns:u="urn:schemas-upnp-org:service:AVTransport:1">
            <InstanceID>0</InstanceID><CurrentURIMetaData></CurrentURIMetaData><CurrentURI>{0}</CurrentURI>
        </u:SetAVTransportURI>
    </s:Body>
</s:Envelope>